---
kind: method
id: M:Autodesk.Revit.DB.CombinableElementArray.Insert(Autodesk.Revit.DB.CombinableElement,System.Int32)
source: html/e14202d8-9f3e-04d3-3bd8-9b38fdcdda2f.htm
---
# Autodesk.Revit.DB.CombinableElementArray.Insert Method

Insert the specified element into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	CombinableElement item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.CombinableElement`) - The CombinableElement to be inserted into the array.
- **index** (`System.Int32`) - The CombinableElement will be inserted before this index.

## Returns
Returns whether the CombinableElement was inserted into the array.